In [50]:
import pandas as pd
import numpy as np
from sklearn.model_selection import train_test_split
from sklearn.utils import resample
import matplotlib.pyplot as plt
import random
import uuid
import hashlib
import seaborn as sns

In [51]:
df = pd.read_csv("C:/Users/jesus/Desktop/curso IA/clientes.csv")

In [52]:
df

                 nombre       direccion  edad  categoria  salario
0        Richard Martin     784 Stevens    62          0    61050
1           James Jones      729 Neruda    65          1    53824
2       Patricia Wilson   935 Dickinson    18          0    60281
3    Elizabeth Robinson       459 Rilke    21          1    42187
4         Charles Brown    823 Ginsberg    21          1    37589
..                  ...             ...   ...        ...      ...
195       Barbara Jones       747 Eliot    47          0    51931
196       Richard Brown      673 Tagore    39          1    47712
197         Mary Garcia      617 Neruda    64          1    45261
198        James Wilson       236 Keats    43          1    46787
199        Robert Jones  563 Baudelaire    34          0    36463

[200 rows x 5 columns]

In [53]:
df['edad'] = (df['edad'] // 10 ) * 10
df

                 nombre       direccion  edad  categoria  salario
0        Richard Martin     784 Stevens    60          0    61050
1           James Jones      729 Neruda    60          1    53824
2       Patricia Wilson   935 Dickinson    10          0    60281
3    Elizabeth Robinson       459 Rilke    20          1    42187
4         Charles Brown    823 Ginsberg    20          1    37589
..                  ...             ...   ...        ...      ...
195       Barbara Jones       747 Eliot    40          0    51931
196       Richard Brown      673 Tagore    30          1    47712
197         Mary Garcia      617 Neruda    60          1    45261
198        James Wilson       236 Keats    40          1    46787
199        Robert Jones  563 Baudelaire    30          0    36463

[200 rows x 5 columns]

In [54]:
ruido = np.random.normal(0, 100, size=df['salario'].shape  )
ruido

array([-128.32883691,  113.00426879,  -20.73778339,  -21.7859269 ,
         90.08686506,   72.45707702, -139.95060174,  115.95920965,
       -211.32365032,   68.28688691,   11.24752681,   -5.21809076,
         91.02546583,   48.28605362,    0.89684501,  -33.9983947 ,
        -87.55986   ,  -60.21660818,  -93.20581266,  109.81553751,
       -156.82979252, -119.0112939 ,  -90.56628306, -118.34384475,
         11.64538719,  140.63142327,   95.51707536,  125.95003514,
        -67.81646142, -170.75919469,   82.24118925,  210.99867775,
       -133.24901088,  -63.76921863, -136.11364833,   53.54313673,
        -46.92899882,  122.26163443, -220.28424143,  -46.3714409 ,
        -13.22433769,    1.26507087,   18.18418971,  187.52057687,
          6.76816138,  -68.5429912 , -113.00746585,   40.44572461,
         91.1655655 ,   15.47559444, -103.13794001,   96.83614956,
          6.35381971,   92.93181156, -113.6307401 ,  -64.12219682,
        -47.57011344, -103.60259578,   91.90653868,   -3.14817691,
         63.48870594,   32.53631623,  -98.4046127 ,  -83.5723384 ,
        -12.09145435,  127.71745757,  -35.99286676,   94.48495116,
       -121.27488286, -134.10816956,  -37.73426706,  -31.20419044,
         45.88206401,  -73.35990888,  174.78750833,  -96.97027786,
         45.906788  ,   83.48699676,  105.78287358,   90.9425423 ,
        -20.02594034,   25.54993812, -111.24407052, -101.36125766,
         34.55912821,  214.98793834, -127.32919615,   22.73056894,
        -37.31436507,   -0.5744765 , -206.56582574,  176.09551674,
         93.65140822,  -20.91205383,  -83.13884175,   51.69450726,
         10.90510304,   21.51817741,  -95.43710723,   15.03720198,
         58.46251278,  -52.90739451,   29.75041818, -119.61418775,
          8.30276938,  -82.95396368,    5.45880638,    3.25204558,
        175.86869183,  108.3076748 , -114.97009421,    9.60586156,
        221.98872099,   22.49736528,  -49.06011079,  144.75596219,
        -49.63782921,  -68.95553097, -160.95876911,   42.84349946,
       -215.82614569,  113.94920942,  -46.79735132,  -74.19596222,
         37.29022789, -119.1466889 ,   44.16643382,  -69.38621949,
       -108.69231734,  -62.35469375,  -89.58855754,  -47.41560707,
         26.61814692,  244.11300899,    6.25271796,  -23.06660511,
         56.12705874,  105.38546648,  183.77989405,  115.58817136,
        121.43029632, -115.76664559,  -28.74102237,  -53.11628074,
       -112.3402033 ,  -50.53370933, -129.2567849 ,  -76.55767765,
         92.3980934 ,  116.69359405,   93.21628833, -143.14921819,
         95.30735354,   -6.62299468,  240.18313214,  -96.51631524,
       -118.6587434 , -142.08998331,  306.98237628,  -38.39562954,
         61.30201198,   82.6585584 , -115.69651823,   58.77455539,
         33.25488339,  285.19033587,    3.4976885 ,   19.74294246,
         74.09063008,  158.90262409,  -96.5111599 ,   20.85426029,
        -50.34682615,   53.97942376,  102.84526704,  -16.35281231,
        -87.10736854, -191.16406074,  -88.58357927, -109.21831057,
          2.09395086,   78.65298321,  128.37601625,   29.47192204,
        118.46200143, -198.25353857,   57.85655804,   75.27089625,
        -75.82006791,    1.14717765,  -20.86361508, -138.3152173 ,
         69.00286507,   71.2893831 , -161.86778941,   -6.42664293,
        -89.4271825 ,  -17.61172762,  -13.150761  ,   31.11062292])

In [55]:
df['salario'] += ruido
df

                 nombre       direccion  edad  categoria       salario
0        Richard Martin     784 Stevens    60          0  60921.671163
1           James Jones      729 Neruda    60          1  53937.004269
2       Patricia Wilson   935 Dickinson    10          0  60260.262217
3    Elizabeth Robinson       459 Rilke    20          1  42165.214073
4         Charles Brown    823 Ginsberg    20          1  37679.086865
..                  ...             ...   ...        ...           ...
195       Barbara Jones       747 Eliot    40          0  51924.573357
196       Richard Brown      673 Tagore    30          1  47622.572818
197         Mary Garcia      617 Neruda    60          1  45243.388272
198        James Wilson       236 Keats    40          1  46773.849239
199        Robert Jones  563 Baudelaire    30          0  36494.110623

[200 rows x 5 columns]

In [56]:
df.drop( 'direccion', axis=1, inplace=True )
df

                 nombre  edad  categoria       salario
0        Richard Martin    60          0  60921.671163
1           James Jones    60          1  53937.004269
2       Patricia Wilson    10          0  60260.262217
3    Elizabeth Robinson    20          1  42165.214073
4         Charles Brown    20          1  37679.086865
..                  ...   ...        ...           ...
195       Barbara Jones    40          0  51924.573357
196       Richard Brown    30          1  47622.572818
197         Mary Garcia    60          1  45243.388272
198        James Wilson    40          1  46773.849239
199        Robert Jones    30          0  36494.110623

[200 rows x 4 columns]

In [57]:
id_psuedo = []

In [58]:
for n in range( len(df) ):
    id_psuedo.append( uuid.uuid4() )
id_psuedo

[UUID('7c14a8eb-3314-47ab-9b39-038a7780d13a'),
 UUID('4a4736cd-5888-48a3-b58c-11985279ef4f'),
 UUID('92f349df-beed-40ba-8e1f-d5e1870dde9f'),
 UUID('c35375e0-ef95-4a17-8219-93cf85f1aa7c'),
 UUID('ef407f06-6588-4871-820c-f67f316ac02f'),
 UUID('3ebafba0-26a2-4d4a-a452-661c068e499e'),
 UUID('a1df4634-42d7-4869-8f80-34daee69cd62'),
 UUID('bec9b721-d610-4584-bd42-15c7d9bbd101'),
 UUID('0c2a95d5-3340-4b66-8bd1-6c1af266159e'),
 UUID('0ec0c5f6-bcfe-412a-b264-22204449843d'),
 UUID('bfbd4225-f3c0-4693-9e5c-6c174cc88586'),
 UUID('88f6449f-5cd2-4e03-af78-c39eb182a33d'),
 UUID('ebd60309-deee-4027-ab5b-0f86d6999b1e'),
 UUID('722904f9-c229-4cd0-989c-043e82601cca'),
 UUID('ca3f0163-2a4a-4e4c-b2a8-c10845300d26'),
 UUID('12c0fe43-6487-4d6d-a3c3-85a6a1b221fe'),
 UUID('a2833a0d-859c-40ce-a056-eb0e18e89a1b'),
 UUID('a71b856e-82e1-430d-872a-96a18fa36544'),
 UUID('775d7884-e73b-4b4d-813d-c9eb17b079cd'),
 UUID('7c383374-78b4-4bb5-bb32-738337c70979'),
 UUID('b9d0aaa0-4dac-420c-8291-12ec512b31a4'),
 UUID('45f9ad85-bd1d-4ba6-8656-ebc78a13c1ea'),
 UUID('6a034a39-258f-4a26-8cae-e680c337b496'),
 UUID('ab9fc5aa-c5f4-4f55-b306-846da38b245b'),
 UUID('97cad499-ff61-4ede-8e6a-994d298917eb'),
 UUID('ccd7fbc1-ec62-47bb-9467-6afafc1a5b69'),
 UUID('459b3908-1fdf-4f87-85c3-b7ab14f96e73'),
 UUID('6461a84b-d0bc-47ad-98ee-4beff7696138'),
 UUID('8d168abe-b6c0-48c9-aad9-cb1051a82507'),
 UUID('d8daa324-682b-4f95-acf3-22ef325cbd0f'),
 UUID('4c4f5896-b1e5-4184-979f-ecdabcc7bef5'),
 UUID('9af63056-a912-4956-bc37-ead41deaff21'),
 UUID('3bf649dd-88f1-46d8-a4a3-1427c1808815'),
 UUID('b2316c08-124a-43bb-b5ac-dbe893b3f0b0'),
 UUID('c5821cfe-972c-4ad8-9b3f-6ca4036c9bde'),
 UUID('6f8dbe49-6f73-4d51-9c7e-23f24fb075bd'),
 UUID('d6af35f8-1cbe-4d6d-afa9-e258f5cbcfdb'),
 UUID('1d60c41f-27fc-4caf-9851-ab853b4788b3'),
 UUID('135252c7-58ef-41d5-afdb-5fd7e1c6f0bd'),
 UUID('13727ff1-11c9-496a-8872-c62b878f0e9e'),
 UUID('e1d22c1a-2368-4a55-bb6a-f4e7167de732'),
 UUID('fd887654-5275-4337-936f-20eb7d93705d'),
 UUID('47e9c053-0887-449e-a029-094273be928b'),
 UUID('1ecff9c3-1926-42a6-9f4d-aa1a6bb58257'),
 UUID('8bf050e4-9cb4-4c5d-af42-1290463026b2'),
 UUID('5cb7131c-bf87-4fa0-82f9-c633545ca4d6'),
 UUID('9a0276e0-b5a2-47e9-b71d-df8c083f45cd'),
 UUID('05f7a246-4453-48de-a9f0-b12f23fe9c34'),
 UUID('6f677e57-b0ad-4fb7-8621-aa37f6a5edc5'),
 UUID('2001c599-47a0-41bd-98dc-0f52a16751fa'),
 UUID('f6c11ae8-8ec4-4d75-981c-8c094c9268d9'),
 UUID('92034ddc-f964-4499-a0d0-2aea1097f0a5'),
 UUID('edb23d8c-c58f-486a-bb4b-2617ed241255'),
 UUID('e48f3750-0bbc-4789-b5f0-6a002a063741'),
 UUID('781abd7d-03e1-43f1-b3ce-d51e05d4e02b'),
 UUID('d5f492c7-1fc6-4711-8c14-d2636f626370'),
 UUID('0c744010-6808-4646-b769-5653aac86881'),
 UUID('a15311bf-ae92-4e06-9fb3-ce4159800603'),
 UUID('ceca58e6-ad55-415c-8930-2e04d17dbaef'),
 UUID('bcc6cfcf-7f1a-49e8-b9eb-1a96cc19b3a4'),
 UUID('6a213eb1-b01d-4361-be5f-94e98e25da4c'),
 UUID('16fc37c7-2c56-47a0-8556-a52ccc8b4904'),
 UUID('16d57e70-d364-4124-8ed9-204a8333e410'),
 UUID('0dde61bb-4377-402b-b64d-868660f0a76f'),
 UUID('242cb039-7c06-4893-93ca-2b02fe891453'),
 UUID('ccbd5a74-57cd-43db-9ca5-3467d97b1bbd'),
 UUID('9ba7f772-fe51-4457-b9a6-805d5255fb5e'),
 UUID('bda93857-e1c5-4422-92a6-11f3195f9d64'),
 UUID('42d80c75-5c8f-4de4-bc38-6c3b2bab9690'),
 UUID('a389a647-9347-4eba-943f-438e5771d86a'),
 UUID('9f495dcf-d223-46fd-b421-029a49ac6005'),
 UUID('5336c8ae-b507-407e-85ed-d846abb4437d'),
 UUID('2fb6da0b-55e5-4bb9-ab7f-7d848dc362e6'),
 UUID('a7ce6385-c111-4835-ac52-468eb0df9705'),
 UUID('4d04b167-abe5-4ed8-a054-9cee4db27a52'),
 UUID('798eb26d-d7f9-46bb-98db-c6d847cecf17'),
 UUID('6fbe8ca2-31ee-4e51-a004-c00b0944b4ca'),
 UUID('87888d98-9cc3-4921-a1c5-5010259e692a'),
 UUID('e4b3b7dd-0578-4156-937b-e206945a339d'),
 UUID('efa48c08-245e-49c5-80f6-574f2c26bda1'),
 UUID('e95af7ef-4100-44ea-9554-0c7b25ac48f6'),
 UUID('f69db279-7685-432e-99bc-f1cc35b8bbb8'),
 UUID('9a23c1aa-4f48-4f00-ae5e-b50be82bddef'),
 UUID('870e7b2e-7f25-40e3-a351-e55a0b6e9397'),
 UUID('942f8390-2032-40a9-bea1-abbd10a0a96b'),
 UUID('b3aaad16-4bef-4e0f-93fe-e1f4e1e168cb'),
 UUID('eed464dd-df4f-41c1-8ebd-09a336c45ade'),
 UUID('1a7624e5-a9c1-47e2-9b2d-bf1a34fa9d32'),
 UUID('bb3749ec-a778-49da-bf22-2f999d7f0748'),
 UUID('9b8956e6-a63f-4ee9-8875-1ab8292e5428'),
 UUID('ba0523b8-7589-4bee-aafe-629ebdd4bc8a'),
 UUID('af55ba16-bfd5-49db-9e2c-07aa890001b7'),
 UUID('9ab57a57-76b8-45c1-8b68-99a44912af33'),
 UUID('67ec8ec5-8fce-46c5-856e-682b2c753067'),
 UUID('a6dacc8c-d897-439c-9669-10176ffbb820'),
 UUID('056d7712-ea97-4f5d-b2d0-3c6d922c6ca1'),
 UUID('296abe18-41c0-4e25-a68b-971265b02615'),
 UUID('e28fcdb3-41b1-4019-8fe3-bb728a165923'),
 UUID('28a45d8f-4943-47b0-b57c-a1c145a45e42'),
 UUID('118e5aa5-e053-4c6a-8a4e-6e1b1274405b'),
 UUID('c372dfd8-b88f-436e-bebc-8d19cf465716'),
 UUID('85ea90bf-daf8-460c-a61e-f4f1a139ae05'),
 UUID('a7f8f743-0a31-4b93-8822-c877d19d30bd'),
 UUID('b87aeb4a-9801-4c43-a686-0dc5073dcd60'),
 UUID('6e6855d9-05af-49e7-8fb8-47daaef8015d'),
 UUID('465ac080-ab85-48d5-b8f9-2f708ef486dd'),
 UUID('abd930a2-3c4e-46a5-a517-dfcdf8d4560e'),
 UUID('de8f3421-02e6-4c2d-a063-a732a208ce6e'),
 UUID('d913c553-c440-46c7-bad3-7c6a23ff3b38'),
 UUID('f2ca6fa0-1df0-487c-bee3-c9870ca66fc8'),
 UUID('557fc79e-c4c0-48c2-b54d-528ec8750944'),
 UUID('ecd27bb7-843f-4368-822f-9e6e0dd38a28'),
 UUID('20e5310a-d8ad-466c-85f8-d24b8d73e337'),
 UUID('cd489858-20bd-48a1-9253-b96b1295b058'),
 UUID('ca2822a7-352a-42e8-90cd-dde6f2707dcb'),
 UUID('c12cd981-c6cf-433e-b107-4f847bf7d662'),
 UUID('ab0f06f4-ae1c-48f4-add5-56e602918e96'),
 UUID('0011aa7c-064f-4d12-bbd6-0a1acff3af02'),
 UUID('169112c9-aa49-4441-a5c2-e1da64dc2229'),
 UUID('0778ef48-b196-465a-be7e-0e8f061d4f2d'),
 UUID('56975547-ebc1-4d4f-a174-0e4ec954da1d'),
 UUID('39aa1474-f29e-40d0-a9b6-467ed2dc6022'),
 UUID('86614b36-3e10-4b35-9439-7055e2e62e9b'),
 UUID('212c4ebc-fe4a-454d-9944-00a1cb46d4b2'),
 UUID('78e953c2-7125-4e39-bb3f-a0b37fb865c9'),
 UUID('7f21f27f-33f2-4f7a-8f95-e10ff5548b29'),
 UUID('9fad7706-1c2d-449a-bb41-71f01cd8cc4a'),
 UUID('5cc5991d-e63d-4180-934d-b78da6aabf08'),
 UUID('fe35846a-c2b9-42b8-8669-f63e683a3e2d'),
 UUID('3231dfde-bd12-48fb-a2be-d29d68ff960e'),
 UUID('069c9afb-7a3f-464e-b4b1-1e6eb58f3aee'),
 UUID('b0b46187-776b-4e03-82c2-203261c589da'),
 UUID('f4ede17b-297f-4096-8a96-81e34101a9ef'),
 UUID('90b530d9-7753-4fca-b9f7-f459bf6e0846'),
 UUID('a5a0640c-914a-439d-acba-3a942c0f6d03'),
 UUID('580acdb3-371c-4871-838b-1189459a3905'),
 UUID('3f4c982f-0e22-4dec-af7b-064dc34f0907'),
 UUID('b527877e-dd40-4998-8253-a9a34a9a8217'),
 UUID('e75141d1-00b1-4c8d-9f39-5d77502e0973'),
 UUID('f77ecf3b-025d-424f-8436-61e8742cbf5f'),
 UUID('de57165c-f1a2-42af-afd2-66d479f3eb19'),
 UUID('5375f51f-5f46-471b-853e-38c558b1c965'),
 UUID('e39bd6ce-0f3e-4d63-9a42-e06409eb685d'),
 UUID('6d43d62c-2ccb-4ee2-9b62-c90e3343e6a4'),
 UUID('c8402e17-4f9f-4d12-bf9f-0f41a306c7bd'),
 UUID('1b5c22a6-bce0-4ac3-8e9d-f8c31702ae6a'),
 UUID('abb9bf27-4a5a-4dcd-b633-c11156d18464'),
 UUID('e9f1f1a6-f79c-4bf9-bfdb-029edfeb5ab4'),
 UUID('d16628d6-47a7-4fcf-aac8-58c064799661'),
 UUID('560ec247-06e7-4525-8f10-20ff0e3fff4e'),
 UUID('346cb409-28a2-4deb-9cb7-59fdf0f4c163'),
 UUID('909cdbab-3bba-404a-8e65-66767149a7fe'),
 UUID('ee31b1fc-1f61-413c-b4bb-a3a8723cee91'),
 UUID('d93f3b3e-f54d-4389-ae3f-5d8d20c7eada'),
 UUID('aed4ddf0-dff9-4095-8a27-44e9a40c7e21'),
 UUID('15a9a2b2-15df-4d1e-b678-db9eb751e835'),
 UUID('63bc8681-eb66-4bb8-8f40-9b35380be54f'),
 UUID('a8b68f55-d268-4722-adf5-87d05058708e'),
 UUID('d59b08bc-e03c-48be-87a9-3ad19db89ddd'),
 UUID('375c18d8-fe58-4a99-824a-a0316e11b6a1'),
 UUID('66930d09-e5bc-49fc-aade-64b1ca83f628'),
 UUID('f9c49847-b2ff-4480-990f-da253a98aee4'),
 UUID('1b5c70fa-e805-43d8-b8d4-e6e0189294e4'),
 UUID('1a271cdb-82e6-4e79-88dd-71af6b7d137f'),
 UUID('2f0d4a3c-496a-4478-b53a-77b602bce81b'),
 UUID('7d756f4a-158b-4c67-b64b-486e67ad8b1f'),
 UUID('52bd2e9a-7fa1-45fb-a3ff-bed710afb3f1'),
 UUID('d2d7640e-1307-4e03-a105-5985b4faeb59'),
 UUID('31f4a7fe-5470-4328-8412-52245fba4c4f'),
 UUID('96ba5281-7a28-40e6-9809-2ba6a17b8dfb'),
 UUID('2308de89-c317-45cd-9a95-1cff7861a64b'),
 UUID('b7413456-116d-44b8-bfb0-f72cd3b28d5c'),
 UUID('f0b81961-e693-4e86-810c-487a75adb335'),
 UUID('2d4b45ae-ca4e-4762-97b4-9cbda3724794'),
 UUID('564d1bfc-9197-4d7c-8977-b8c2d3a17d22'),
 UUID('a50643de-8dbe-43a6-9903-7c915ef00f42'),
 UUID('e0a00fd0-8afa-4bd3-b1af-9cebe12ffbf7'),
 UUID('ebb06966-d1a6-4771-be74-104799b6fbfd'),
 UUID('d59c9774-74ee-43b1-9858-196475f3d27c'),
 UUID('dfccd4e0-4b1a-49e0-b09e-962d176c5be9'),
 UUID('be6e5f1e-2c7a-4e19-94be-1a70f8cef1d9'),
 UUID('b96c9635-bb99-4ca0-85c1-19bb71e42cd5'),
 UUID('7af6f40c-daa1-4bec-b948-f7cd56f9bb04'),
 UUID('c9fb36b5-9e6e-4083-942e-5d76a8f3e317'),
 UUID('c1bdbc15-8a27-4920-9d24-0bb37fbbe7bd'),
 UUID('2c3f1ef5-cd81-48f8-86e3-3a722e5ac171'),
 UUID('f85b2f75-42b6-4f92-8f8c-45c9b61ddd62'),
 UUID('6a1b5a91-7b1a-4397-a064-7969fa788b33'),
 UUID('dcbd833a-d845-47f1-8284-060d981915e6'),
 UUID('f561b861-5c57-498d-aefb-647966aa8eac'),
 UUID('8d3c6d86-73c5-4e3f-86c4-717f8034d4ad'),
 UUID('d65f54d1-9b5e-49e0-8a8e-0ee92f4fea03'),
 UUID('6c625492-9c46-4460-bfdf-51e49b0aabb3'),
 UUID('12887884-74c1-4d51-8232-dccc89a01efc'),
 UUID('447b6afb-0f56-4783-a5bb-35c43ccb2464'),
 UUID('dfc0a2e0-2cf5-4787-a295-33fc961ae1bf'),
 UUID('bb70b290-25e3-4da5-924b-988665c2feec'),
 UUID('e82794d8-822b-4204-b7d1-b849d073f044'),
 UUID('e86fa711-179b-4b5c-b1c6-384c54c9920b'),
 UUID('1d93dc54-1fa7-49d3-b1b0-9f60588f0733')]

In [59]:
df['id_pseudo'] = id_psuedo
df.drop( 'nombre', axis=1, inplace=True )
df

     edad  categoria       salario                             id_pseudo
0      60          0  60921.671163  7c14a8eb-3314-47ab-9b39-038a7780d13a
1      60          1  53937.004269  4a4736cd-5888-48a3-b58c-11985279ef4f
2      10          0  60260.262217  92f349df-beed-40ba-8e1f-d5e1870dde9f
3      20          1  42165.214073  c35375e0-ef95-4a17-8219-93cf85f1aa7c
4      20          1  37679.086865  ef407f06-6588-4871-820c-f67f316ac02f
..    ...        ...           ...                                   ...
195    40          0  51924.573357  dfc0a2e0-2cf5-4787-a295-33fc961ae1bf
196    30          1  47622.572818  bb70b290-25e3-4da5-924b-988665c2feec
197    60          1  45243.388272  e82794d8-822b-4204-b7d1-b849d073f044
198    40          1  46773.849239  e86fa711-179b-4b5c-b1c6-384c54c9920b
199    30          0  36494.110623  1d93dc54-1fa7-49d3-b1b0-9f60588f0733

[200 rows x 4 columns]

In [60]:
agrupado = df.groupby('categoria')
agrupado

In [61]:
data_balanceada = pd.DataFrame()

In [62]:
for nombre, grupo in agrupado:
    grupo_balandeado = resample(grupo, replace=True, n_samples=100, random_state=123)
    data_balanceada = pd.concat( [data_balanceada, grupo_balandeado] )

data_balanceada

     edad  categoria       salario                             id_pseudo
158    50          0  41849.982376  d59b08bc-e03c-48be-87a9-3ad19db89ddd
42     30          0  59453.184190  47e9c053-0887-449e-a029-094273be928b
194    40          0  49649.132211  447b6afb-0f56-4783-a5bb-35c43ccb2464
133    50          0  42081.113009  90b530d9-7753-4fca-b9f7-f459bf6e0846
114    60          0  53386.939889  ca2822a7-352a-42e8-90cd-dde6f2707dcb
..    ...        ...           ...                                   ...
179    40          1  54085.781689  dfccd4e0-4b1a-49e0-b09e-962d176c5be9
80     10          1  56231.974060  e95af7ef-4100-44ea-9554-0c7b25ac48f6
93     50          1  49348.087946  67ec8ec5-8fce-46c5-856e-682b2c753067
156    50          1  47988.341257  63bc8681-eb66-4bb8-8f40-9b35380be54f
81     30          1  43115.549938  f69db279-7685-432e-99bc-f1cc35b8bbb8

[200 rows x 4 columns]

In [ ]:
plt.figure(figsize=(12,7))
ax = sns.histplot( df['edad'], kde=True, color='skyblue', bins=30 )
ax.set( title='Dsitribucion de edad de los clientes', xlabel='Edad', ylabel='Frecuencia' )